## Pandas

1. pd.DataFrame(dictionary) -> creating a dataframe from a dictionary<br><br>

2. pd.read_csv('path', header = None) -> loading dataset without headers
3. df.columns = ['header1', 'header2'] -> setting column names<br><br>

4. df.index -> returns the number of rows
5. df.index.name -> rename the index column or None
6. pd.read_csv('path', index_col = 3) -> set a column as the index column<br><br>

7. df.info() -> dtypes and no of non null elements in all columns
8. df.describe() -> statistical summary, can handle non numeric columns<br><br>

9. df.loc(name of the row/column) -> eg: df5.loc[~((df5['country code'] == 'ASPAC') & (df.cars_per_cap > 201))]
10. df.iloc(index starting from 0 from the first row) -> loc works on values<br>they both are used to filter the dataset<br><br>

11. df5.query("(`country code` == 'ASPAC') and (cars_per_cap > 70)") -> other way to filter dataset, the string headers with spaces are under `backticks `

12. df.drop(['column'], axis = 1) -> dropping a column

13.df.drop(index) -> dropping a row<br><br>

14. df.to_csv('output.csv', index = False)<br><br>

15. df.shape, len(df) -> (rows,columns), no of rows<br><br>

16. df[['column1', 'column2']] -> subsettinga dataframe, make sure to have double brackets otherwise a series will be returned in place of a dataframe

17. df.select_dtypes('int') -> selecting the column with a specific datatype only<br><br>

18. Statistical Summary functions - sum, min, max, std, var, count, quantile, mean, agg to view multiple statistical functions, unique, value_counts<br><br>

19. reset_index to provide indexing to the dataset<br><br>

20. Advanced Column Methods - rank, shift, cumsum, cumin, cummax, rolling, clip<br><br>

21. GroupBy Methods - df5.groupby('country code')[['cars_per_cap']].sum() -> 
groups by country code and finds the sum of cars_per_cap of all the country codes grouped together<br><br>

22.join<br><br>

23. New Columns - assign<br><br>

24. Sorting - sort_values<br><br>

25. Handling Missing Data - isna, isna().sum(), dropna, fillna<br><br>

26. Combining Data - copy, pd.concat<br><br>

27. Merging Data - df1.merge(df2), pd.merge(df1, df2, on = ['column'])<br><br>

In [1]:
import pandas as pd
import numpy as np
import sys
print('system version', sys.version)
print()
print('pandas version', pd.__version__)

system version 3.11.4 (tags/v3.11.4:d2340ef, Jun  7 2023, 05:45:37) [MSC v.1934 64 bit (AMD64)]

pandas version 2.1.1

### Creating a dataframe using a dictionary

In [81]:
## create a dataframe using a dictionary
cars_per_cap = [100,234,354,421,235]
country = ['india', 'usa', 'canada', 'russia', 'china']
drives_right = [True, False, False, False, True]

In [82]:
dic = {"cars_per_cap" : cars_per_cap,
       "country" : country,
       "drives_right" : drives_right}
dic

{'cars_per_cap': [100, 234, 354, 421, 235],
 'country': ['india', 'usa', 'canada', 'russia', 'china'],
 'drives_right': [True, False, False, False, True]}

In [4]:
df = pd.DataFrame(dic)
df

   cars_per_cap country  drives_right
0           100   india          True
1           234     usa         False
2           354  canada         False
3           421  russia         False
4           235   china          True

### Creating a dataframe using a csv file with no column/header names

In [5]:
df5 = pd.read_csv('book1.csv', header = None)
df5

       0    1              2      3       4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS     Austrailia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

### Renaming the column names/headers using columns function

In [6]:
df5.columns = ['country code','region', 'country', 'cars_per_cap', 'drives_right']
print(df5)
print(type(df5))

  country code region        country  cars_per_cap drives_right
0         USCA     US  United States         809.0       False
1        ASPAC    AUS     Austrailia         731.0        True
2        ASPAC    JAP          Japan         588.0        True
3        ASPAC     IN          India          18.0        True
4        ASPAC     RU         Russia         200.0       False
5        LATAM    MOR        Morocco          70.0       False
6          AFR     EG          Egypt          45.0       False
7          EUR    ENG        England           NaN        True
<class 'pandas.core.frame.DataFrame'>

### Checking how many indices/rows are there

In [7]:
df5.index

RangeIndex(start=0, stop=8, step=1)

### Setting a single column or multiple columns as the index column
index_col = column number which you want to set as index column

In [8]:
df1 = pd.read_csv('book2.csv', header = None, index_col = 3)
df1

           0    1              2       4
3
809.0   USCA   US  United States  False
731.0  ASPAC  AUS     Austrailia   True
588.0  ASPAC  JAP          Japan   True
18.0   ASPAC   IN          India   True
200.0  ASPAC   RU         Russia  False
70.0   LATAM  MOR        Morocco  False
45.0     AFR   EG          Egypt  False
NaN      EUR  ENG        England   True

In [9]:
df2 = pd.read_csv('book2.csv', header = None, index_col = [0,1])
df2

                       2      3       4
0     1
USCA  US   United States  809.0  False
ASPAC AUS     Austrailia  731.0   True
      JAP          Japan  588.0   True
      IN           India   18.0   True
      RU          Russia  200.0  False
LATAM MOR        Morocco   70.0  False
AFR   EG           Egypt   45.0  False
EUR   ENG        England    NaN   True

In [10]:
df1.columns = ['country code', 'region','country', 'drives_right']
df1

      country code region        country drives_right
3
809.0         USCA     US  United States       False
731.0        ASPAC    AUS     Austrailia        True
588.0        ASPAC    JAP          Japan        True
18.0         ASPAC     IN          India        True
200.0        ASPAC     RU         Russia       False
70.0         LATAM    MOR        Morocco       False
45.0           AFR     EG          Egypt       False
NaN            EUR    ENG        England        True

In [11]:
df1.index

Index([809.0, 731.0, 588.0, 18.0, 200.0, 70.0, 45.0, nan], dtype='float64', name=3)

### Rename/delete the name of the index column

In [12]:
df1.index.name = 'cars_per_cap' # rename
print(df1)

df1.index.name = None # delete
print(df1)

             country code region        country drives_right
cars_per_cap
809.0                USCA     US  United States       False
731.0               ASPAC    AUS     Austrailia        True
588.0               ASPAC    JAP          Japan        True
18.0                ASPAC     IN          India        True
200.0               ASPAC     RU         Russia       False
70.0                LATAM    MOR        Morocco       False
45.0                  AFR     EG          Egypt       False
NaN                   EUR    ENG        England        True
      country code region        country drives_right
809.0         USCA     US  United States       False
731.0        ASPAC    AUS     Austrailia        True
588.0        ASPAC    JAP          Japan        True
18.0         ASPAC     IN          India        True
200.0        ASPAC     RU         Russia       False
70.0         LATAM    MOR        Morocco       False
45.0           AFR     EG          Egypt       False
NaN            EUR    ENG        England        True

### Display first 3 rows and last 3 rows of the dataset

In [13]:
print(df1.head(3))
print(df1.tail(3))

      country code region        country drives_right
809.0         USCA     US  United States       False
731.0        ASPAC    AUS     Austrailia        True
588.0        ASPAC    JAP          Japan        True
     country code region  country drives_right
70.0        LATAM    MOR  Morocco       False
45.0          AFR     EG    Egypt       False
NaN           EUR    ENG  England        True

### Display the information about the data stored in the dataframe

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 809.0 to nan
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country code  8 non-null      object
 1   region        8 non-null      object
 2   country       8 non-null      object
 3   drives_right  8 non-null      object
dtypes: object(4)
memory usage: 320.0+ bytes

### Display the statistical information of the dataset

In [15]:
print(df1.describe()) # for the whole dataset

       country code region        country drives_right
count             8      8              8            8
unique            5      8              8            2
top           ASPAC     US  United States       False
freq              4      1              1            4

In [16]:
print(df1['region']) #  as a series although here its showing as dataframe only
print(type(df1))
print(df1[['region']]) # as a dataframe 
print(type(df1))

809.0     US
731.0    AUS
588.0    JAP
18.0      IN
200.0     RU
70.0     MOR
45.0      EG
NaN      ENG
Name: region, dtype: object
<class 'pandas.core.frame.DataFrame'>
      region
809.0     US
731.0    AUS
588.0    JAP
18.0      IN
200.0     RU
70.0     MOR
45.0      EG
NaN      ENG
<class 'pandas.core.frame.DataFrame'>

### Note : iloc uses index number/name and loc uses row name or column name

### Access specific data from their row index - iloc

In [17]:
df1.iloc[6]

country code       AFR
region              EG
country          Egypt
drives_right    False
Name: 45.0, dtype: object

### Access specific data based on their index name/number - loc

In [18]:
df1.loc[200]

country code     ASPAC
region              RU
country         Russia
drives_right    False
Name: 200.0, dtype: object

### Display multiple selective columns together - direct way or iloc way or loc way

In [19]:
print(df1[['country code','country']])
# or
print(df1.iloc[: ,[0,3]]) # displays all rows of 0th and 3rd column of the dataset
# or
print(df1.loc[: , ['country','country code']]) # displays all rows of the country and country code columns

      country code        country
809.0         USCA  United States
731.0        ASPAC     Austrailia
588.0        ASPAC          Japan
18.0         ASPAC          India
200.0        ASPAC         Russia
70.0         LATAM        Morocco
45.0           AFR          Egypt
NaN            EUR        England
      country code drives_right
809.0         USCA       False
731.0        ASPAC        True
588.0        ASPAC        True
18.0         ASPAC        True
200.0        ASPAC       False
70.0         LATAM       False
45.0           AFR       False
NaN            EUR        True
             country country code
809.0  United States         USCA
731.0     Austrailia        ASPAC
588.0          Japan        ASPAC
18.0           India        ASPAC
200.0         Russia        ASPAC
70.0         Morocco        LATAM
45.0           Egypt          AFR
NaN          England          EUR

### Removing a column

In [20]:
df2 = df.drop(['country'], axis = 1)
df2.head()

   cars_per_cap  drives_right
0           100          True
1           234         False
2           354         False
3           421         False
4           235          True

#### Removing a row

In [85]:
df2 = df.drop(0)
df2
# removes the row of the mentioned index

   cars_per_cap country  drives_right
1           234     usa         False
2           354  canada         False
3           421  russia         False
4           235   china          True

### Saving a notebook as a csv file

In [86]:
df.to_csv('output.csv', index = False) # index = False so that the index is not saved when it doesnt have relevant info

### Sample vs Head - sample gives random data for displaying

In [22]:
df.sample(4)
df.sample(frac = 0.4, random_state = 26) # frac is the fraction of dataset that you want to see, random state helps in reproducability

   cars_per_cap country  drives_right
4           235   china          True
3           421  russia         False

### View column names and their index

In [23]:
df.columns

Index(['cars_per_cap', 'country', 'drives_right'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

### Information about the dataframe and its columns

In [25]:
df.info()
print()
df.info(verbose = False) # for quicker summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cars_per_cap  5 non-null      int64
 1   country       5 non-null      object
 2   drives_right  5 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 217.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Columns: 3 entries, cars_per_cap to drives_right
dtypes: bool(1), int64(1), object(1)
memory usage: 217.0+ bytes

In [26]:
df.describe() # can also handle non numeric columns

       cars_per_cap
count      5.000000
mean     268.800000
std      123.764696
min      100.000000
25%      234.000000
50%      235.000000
75%      354.000000
max      421.000000

In [27]:
df.shape, len(df) # len is same as the number of rows

((5, 3), 5)

### subsetting a dataframe

In [28]:
# subsetting based on columns
df[['cars_per_cap', 'country']] # make sure to have double brackets otherwise in case of single columns if we dont use double brackets then a series will be returned in place of a dataframe

df[df.columns[:2]] # first two columns

df.select_dtypes('int') # selects integer columns

   cars_per_cap
0           100
1           234
2           354
3           421
4           235

In [29]:
# selecting only the columns with a specific data type
df.select_dtypes('int')

   cars_per_cap
0           100
1           234
2           354
3           421
4           235

#### Filtering Rows

In [30]:
df5

  country code region        country  cars_per_cap drives_right
0         USCA     US  United States         809.0       False
1        ASPAC    AUS     Austrailia         731.0        True
2        ASPAC    JAP          Japan         588.0        True
3        ASPAC     IN          India          18.0        True
4        ASPAC     RU         Russia         200.0       False
5        LATAM    MOR        Morocco          70.0       False
6          AFR     EG          Egypt          45.0       False
7          EUR    ENG        England           NaN        True

In [31]:
df5.loc[~((df5['country code'] == 'ASPAC') & (df.cars_per_cap > 201))]
# ~ tilda means not

  country code region        country  cars_per_cap drives_right
0         USCA     US  United States         809.0       False
5        LATAM    MOR        Morocco          70.0       False
6          AFR     EG          Egypt          45.0       False
7          EUR    ENG        England           NaN        True

#### Filtering using Query

In [32]:
df5.query("(`country code` == 'ASPAC') and (cars_per_cap > 70)")

  country code region     country  cars_per_cap drives_right
1        ASPAC    AUS  Austrailia         731.0        True
2        ASPAC    JAP       Japan         588.0        True
4        ASPAC     RU      Russia         200.0       False

#### Summarizing the data

In [33]:
df5['cars_per_cap'].sum()

2461.0

In [34]:
df5['cars_per_cap'].min()

18.0

In [35]:
df5['cars_per_cap'].max()

809.0

In [36]:
df5['cars_per_cap'].std()

345.5955522200564

In [37]:
df5['cars_per_cap'].var()

119436.28571428572

In [38]:
df5['cars_per_cap'].count()

7

In [39]:
df5['cars_per_cap'].quantile()
#  quantile function in pandas helps you find specific points in your data that divide it into equal parts. For example, it can tell you what value separates the lowest 25% of your data from the rest, or what value is exactly in the middle (the median).

200.0

In [40]:
df5['cars_per_cap'].quantile([0.25, 0.50, 0.75])

0.25     57.5
0.50    200.0
0.75    659.5
Name: cars_per_cap, dtype: float64

In [41]:
df5['cars_per_cap'].mean()

351.57142857142856

In [42]:
df5['cars_per_cap'].agg(['min', 'max', 'count'])
# agg method can give multiple statistical summaries together which are mentioned
# agg method can also take a dictionary where the keys are the column names and the values are the list of statistical operations that you want to find for that column

min       18.0
max      809.0
count      7.0
Name: cars_per_cap, dtype: float64

In [43]:
df5['cars_per_cap'].unique()
# unique returns all the unique values 
# also works on the categorical values

array([809., 731., 588.,  18., 200.,  70.,  45.,  nan])

In [44]:
print(df5['cars_per_cap'].value_counts())
# value_counts gives the count of each value in the column

print(df5['cars_per_cap'].value_counts(normalize = True))
# normalize = True gives a fractional value

print(df5[['cars_per_cap', 'country']].value_counts())
# applying value_counts on multiple columns gives the count for the combination of elements from the columns

print(df5[['cars_per_cap', 'country']].value_counts().reset_index())
# applying reset.index after value_counts converts the count details into a dataframe

cars_per_cap
809.0    1
731.0    1
588.0    1
18.0     1
200.0    1
70.0     1
45.0     1
Name: count, dtype: int64
cars_per_cap
809.0    0.142857
731.0    0.142857
588.0    0.142857
18.0     0.142857
200.0    0.142857
70.0     0.142857
45.0     0.142857
Name: proportion, dtype: float64
cars_per_cap  country
18.0          India            1
45.0          Egypt            1
70.0          Morocco          1
200.0         Russia           1
588.0         Japan            1
731.0         Austrailia       1
809.0         United States    1
Name: count, dtype: int64
   cars_per_cap        country  count
0          18.0          India      1
1          45.0          Egypt      1
2          70.0        Morocco      1
3         200.0         Russia      1
4         588.0          Japan      1
5         731.0     Austrailia      1
6         809.0  United States      1

#### Advanced Column Methods

In [45]:
print(df5[['cars_per_cap']].rank())
# assigns ranks the values with rank 1 being the lowest value

print(df5[['cars_per_cap']].rank(method = 'average'))
# average method - if a value occurs twice and its rank would have been 5 and 6 then the final ranking it receives if average of 5 and 6 which is 5.5

   cars_per_cap
0           7.0
1           6.0
2           5.0
3           1.0
4           4.0
5           3.0
6           2.0
7           NaN
   cars_per_cap
0           7.0
1           6.0
2           5.0
3           1.0
4           4.0
5           3.0
6           2.0
7           NaN

In [46]:
print(df5[['cars_per_cap']].shift(2))
# shifts the values down by number of places mentioned and the top elements keep getting NaN meaning its not cyclic

print(df5[['cars_per_cap']].shift(3, fill_value = 100))
# fill_value helps us to fill the NaN values

   cars_per_cap
0           NaN
1           NaN
2         809.0
3         731.0
4         588.0
5          18.0
6         200.0
7          70.0
   cars_per_cap
0         100.0
1         100.0
2         100.0
3         809.0
4         731.0
5         588.0
6          18.0
7         200.0

In [47]:
print(df5[['cars_per_cap']].cumsum())
print(df5[['cars_per_cap']].cummax())
print(df5[['cars_per_cap']].cummin())

#cummim - 
# for 2nd value - min(809,731)
# for 3rd value - min(809,731,588) and so on

   cars_per_cap
0         809.0
1        1540.0
2        2128.0
3        2146.0
4        2346.0
5        2416.0
6        2461.0
7           NaN
   cars_per_cap
0         809.0
1         809.0
2         809.0
3         809.0
4         809.0
5         809.0
6         809.0
7           NaN
   cars_per_cap
0         809.0
1         731.0
2         588.0
3          18.0
4          18.0
5          18.0
6          18.0
7           NaN

In [48]:
df5[['cars_per_cap']].rolling(window = 5)
# rolling - The rolling function in pandas is used to create a rolling window of data over a Series or DataFrame. It allows you to perform rolling computations such as mean, sum, standard deviation, etc., over a specified window size.

df5[['cars_per_cap']].rolling(window = 5).mean()

   cars_per_cap
0           NaN
1           NaN
2           NaN
3           NaN
4         469.2
5         321.4
6         184.2
7           NaN

In [49]:
df5[['cars_per_cap']].clip(100,300)
# values above 300 become 300 and values below 100 become 100

   cars_per_cap
0         300.0
1         300.0
2         300.0
3         100.0
4         200.0
5         100.0
6         100.0
7           NaN

#### GroupBy Methods

In [50]:
print(df5.groupby('country code')[['cars_per_cap']].sum())
print()
# groups by country code and finds the sum of cars_per_cap of all the country codes grouped together
# you can pass multiple columns along with cars_per_cap
print(df5.groupby('country code')[['cars_per_cap', 'country']].agg(['min','max','count']))
print()


# the result of these are multi indexed columns - column ke andar columns therefore we flatten them to convert them into a list of tuples
print(df5.groupby('country code')[['cars_per_cap', 'country']].agg(['min','max','count']).columns.to_flat_index())

# using list comprehension we simplify the headers
df5.columns = [''.join(c) for c in df5.columns]
print(df5.columns)

              cars_per_cap
country code
AFR                   45.0
ASPAC               1537.0
EUR                    0.0
LATAM                 70.0
USCA                 809.0

             cars_per_cap                     country
                      min    max count            min            max count
country code
AFR                  45.0   45.0     1          Egypt          Egypt     1
ASPAC                18.0  731.0     4     Austrailia         Russia     4
EUR                   NaN    NaN     0        England        England     1
LATAM                70.0   70.0     1        Morocco        Morocco     1
USCA                809.0  809.0     1  United States  United States     1

Index([  ('cars_per_cap', 'min'),   ('cars_per_cap', 'max'),
       ('cars_per_cap', 'count'),        ('country', 'min'),
              ('country', 'max'),      ('country', 'count')],
      dtype='object')
Index(['country code', 'region', 'country', 'cars_per_cap', 'drives_right'], dtype='object')

#### New Columns

In [51]:
df5['cars_per_cap 2'] = df5['cars_per_cap'] / 2
df5

#or using assign method

df5 = df5.assign(cars_per_cap_3 = df5['cars_per_cap'] / 10)
df5

,country code,region,country,cars_per_cap,drives_right,cars_per_cap 2,cars_per_cap_3
0,USCA,US,United States,809.0,False,404.5,80.9
1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1
2,ASPAC,JAP,Japan,588.0,True,294.0,58.8
3,ASPAC,IN,India,18.0,True,9.0,1.8
4,ASPAC,RU,Russia,200.0,False,100.0,20.0
5,LATAM,MOR,Morocco,70.0,False,35.0,7.0
6,AFR,EG,Egypt,45.0,False,22.5,4.5
7,EUR,ENG,England,NaN,True,NaN,NaN

#### Sorting

In [55]:
df5.sort_values('cars_per_cap')
# missing values remain at the bottom always

df5.sort_values('cars_per_cap', ascending = False)
# descending order sort

df5[['country', 'region', 'cars_per_cap']].sort_values('cars_per_cap')
# the column based on which sorting is being done should be selected for displaying in the dataframe

df5[['country', 'region', 'cars_per_cap']].sort_values('cars_per_cap').reset_index()
# provides indexing

   index        country region  cars_per_cap
0      3          India     IN          18.0
1      6          Egypt     EG          45.0
2      5        Morocco    MOR          70.0
3      4         Russia     RU         200.0
4      2          Japan    JAP         588.0
5      1     Austrailia    AUS         731.0
6      0  United States     US         809.0
7      7        England    ENG           NaN

#### Handling Missing Data

In [58]:
df5.isna()
# returns true for NaN value 

df5.isna().sum()
# gives sum of missing values in each column

country code      0
region            0
country           0
cars_per_cap      1
drives_right      0
cars_per_cap 2    1
cars_per_cap_3    1
dtype: int64

In [62]:
df6 = df5.dropna()
df6
# drops the rows with missing values

df7 = df5.dropna(subset = ['country code', 'region'])
df7
# drops the rows if there is NaN value in the mentioned columns only

,country code,region,country,cars_per_cap,drives_right,cars_per_cap 2,cars_per_cap_3
0,USCA,US,United States,809.0,False,404.5,80.9
1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1
2,ASPAC,JAP,Japan,588.0,True,294.0,58.8
3,ASPAC,IN,India,18.0,True,9.0,1.8
4,ASPAC,RU,Russia,200.0,False,100.0,20.0
5,LATAM,MOR,Morocco,70.0,False,35.0,7.0
6,AFR,EG,Egypt,45.0,False,22.5,4.5
7,EUR,ENG,England,NaN,True,NaN,NaN

In [65]:
df6 = df5.fillna(df['cars_per_cap'].mean())
df6
# fills the NaN values with the mentioned value

,country code,region,country,cars_per_cap,drives_right,cars_per_cap 2,cars_per_cap_3
0,USCA,US,United States,809.0,False,404.5,80.9
1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1
2,ASPAC,JAP,Japan,588.0,True,294.0,58.8
3,ASPAC,IN,India,18.0,True,9.0,1.8
4,ASPAC,RU,Russia,200.0,False,100.0,20.0
5,LATAM,MOR,Morocco,70.0,False,35.0,7.0
6,AFR,EG,Egypt,45.0,False,22.5,4.5
7,EUR,ENG,England,268.8,True,268.8,268.8

#### Combining Data

In [69]:
df8 = df5.copy()
df9 = df6.copy()

pd.concat([df8, df9])
# combines rows of both the datasets

pd.concat([df8, df9], axis = 1)
# combines columns of both the datasets

,country code,region,country,cars_per_cap,drives_right,cars_per_cap 2,cars_per_cap_3,country code,region,country,cars_per_cap,drives_right,cars_per_cap 2,cars_per_cap_3
0,USCA,US,United States,809.0,False,404.5,80.9,USCA,US,United States,809.0,False,404.5,80.9
1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1
2,ASPAC,JAP,Japan,588.0,True,294.0,58.8,ASPAC,JAP,Japan,588.0,True,294.0,58.8
3,ASPAC,IN,India,18.0,True,9.0,1.8,ASPAC,IN,India,18.0,True,9.0,1.8
4,ASPAC,RU,Russia,200.0,False,100.0,20.0,ASPAC,RU,Russia,200.0,False,100.0,20.0
5,LATAM,MOR,Morocco,70.0,False,35.0,7.0,LATAM,MOR,Morocco,70.0,False,35.0,7.0
6,AFR,EG,Egypt,45.0,False,22.5,4.5,AFR,EG,Egypt,45.0,False,22.5,4.5
7,EUR,ENG,England,NaN,True,NaN,NaN,EUR,ENG,England,268.8,True,268.8,268.8

#### Merging Data

In [80]:
df8.merge(df9)
# merges the datasets based on similar/same columns

df8.merge(df9, how = 'outer') # inner is default, other hows are left, right etc

#or

pd.merge(df8, df9, on = ['country'])
# merge on the mentioned columns, if there are other similar columns whoch are not mention in 'on' then they are treated as different column and a suffix like _x and _y is attached to them

pd.merge(df8, df9, on = ['country'], suffixes = ('1', '2'))
# custom suffixes

pd.merge(df8, df9, left_on = ['country'], right_on = ['country'], suffixes = ('1', '2'))

,country code1,region1,country,cars_per_cap1,drives_right1,cars_per_cap 21,cars_per_cap_31,country code2,region2,cars_per_cap2,drives_right2,cars_per_cap 22,cars_per_cap_32
0,USCA,US,United States,809.0,False,404.5,80.9,USCA,US,809.0,False,404.5,80.9
1,ASPAC,AUS,Austrailia,731.0,True,365.5,73.1,ASPAC,AUS,731.0,True,365.5,73.1
2,ASPAC,JAP,Japan,588.0,True,294.0,58.8,ASPAC,JAP,588.0,True,294.0,58.8
3,ASPAC,IN,India,18.0,True,9.0,1.8,ASPAC,IN,18.0,True,9.0,1.8
4,ASPAC,RU,Russia,200.0,False,100.0,20.0,ASPAC,RU,200.0,False,100.0,20.0
5,LATAM,MOR,Morocco,70.0,False,35.0,7.0,LATAM,MOR,70.0,False,35.0,7.0
6,AFR,EG,Egypt,45.0,False,22.5,4.5,AFR,EG,45.0,False,22.5,4.5
7,EUR,ENG,England,NaN,True,NaN,NaN,EUR,ENG,268.8,True,268.8,268.8